Nickster90s/Inferno-ESP32-P4/main/eth_ts.c
#include "eth_ts.h"
#include "app_config.h"
#include "aoip_wire.h"
#include "esp_eth.h"
#include "esp_eth_driver.h"
#include "esp_event.h"
#include "esp_log.h"
#include "freertos/task.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "esp_mac.h"
#include "soc/soc_caps.h"
#if SOC_EMAC_IEEE1588V2_SUPPORTED
#include "soc/emac_ptp_struct.h"
#endif
#include "lwip/ip4_addr.h"
#include "lwip/sockets.h"
#include <string.h>
#include <stdio.h>

static const char *TAG = "eth_ts";

static esp_eth_handle_t  s_eth;
static esp_eth_mac_t    *s_mac;
static esp_eth_phy_t    *s_phy;
static esp_netif_t      *s_netif;
static uint8_t           s_our_mac[6];
static volatile bool     s_link_up;
static eth_ts_ptp_cb_t   s_ptp_cb;
static int32_t           s_rate_ppb;

// ---------------------------------------------------------------------------
// RX path: lift PTPv1 out, pass everything else to lwIP
// ---------------------------------------------------------------------------
//
// This hook replaces the default stack input so that a frame can be examined
// WITH its hardware timestamp before lwIP ever sees it. Audio does not come
// through here -- it goes to a normal UDP socket -- because audio does not need
// a receive timestamp. Only PTP does.

static inline bool is_ptpv1_frame(const uint8_t *f, uint32_t len,
                                  const uint8_t **payload, uint32_t *plen,
                                  uint16_t *dport)
{
    if (len < 14 + 20 + 8) return false;
    if (dw_rd16(f + 12) != 0x0800) return false;          // IPv4
    const uint8_t *ip = f + 14;
    if ((ip[0] >> 4) != 4) return false;
    uint32_t ihl = (ip[0] & 0x0F) * 4;
    if (ip[9] != 17) return false;                        // UDP
    uint32_t dst = dw_rd32(ip + 16);
    if (dst != PTP1_GROUP_IP && dst != (PTP1_GROUP_IP + 1)) return false;
    const uint8_t *udp = ip + ihl;
    if (udp + 8 > f + len) return false;
    uint16_t dp = dw_rd16(udp + 2);
    if (dp != PTP1_EVENT_PORT && dp != PTP1_GENERAL_PORT) return false;
    uint32_t ulen = dw_rd16(udp + 4);
    if (ulen < 8) return false;
    *payload = udp + 8;
    *plen    = ulen - 8;
    *dport   = dp;
    return true;
}

// IDF 5.5 (esp_eth_mac_esp.c, emac_esp32_rx_task): `info` is an
// eth_mac_time_t*. When the descriptor carries no stamp the driver writes
// 0 s / 0 ns rather than signalling it, so an all-zero stamp is "none".
// The PTP clock is initialised to 0 and a real stamp can be 0/0 only in the
// first nanosecond after enable, which is not worth distinguishing.
static bool extract_rx_ts(void *info, eth_ts_time_t *out)
{
    if (!info) return false;
    const eth_mac_time_t *t = (const eth_mac_time_t *)info;
    out->seconds     = t->seconds;
    out->nanoseconds = t->nanoseconds;
    return t->seconds != 0 || t->nanoseconds != 0;
}

static volatile uint32_t s_rx_frames;      // every frame the EMAC delivered
static uint32_t s_rx_kicks, s_rx_restarts, s_phy_resets;
static uint32_t s_rx_dma_state, s_rx_missed, s_rx_fifo_ovf;

static esp_err_t stack_input_info(esp_eth_handle_t eth, uint8_t *buffer,
                                  uint32_t length, void *priv, void *info)
{
    (void)eth;
    s_rx_frames++;
    const uint8_t *payload; uint32_t plen; uint16_t dport;
    if (s_ptp_cb && is_ptpv1_frame(buffer, length, &payload, &plen, &dport)) {
        eth_ts_ptp_frame_t f;
        f.len = plen > sizeof(f.payload) ? sizeof(f.payload) : plen;
        memcpy(f.payload, payload, f.len);
        f.dst_port = dport;
        f.ts_valid = extract_rx_ts(info, &f.ts);
        s_ptp_cb(&f);
        // Fall through: lwIP is welcome to it too. Nothing there listens on
        // 319/320, so this costs one socket lookup and keeps the path simple.
    }
    return esp_netif_receive((esp_netif_t *)priv, buffer, length, NULL);
}

// ---------------------------------------------------------------------------
// Events
// ---------------------------------------------------------------------------

void eth_ts_log_eee(void);

static void eth_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg; (void)base; (void)data;
    switch (id) {
    case ETHERNET_EVENT_CONNECTED:
        s_link_up = true;
        ESP_LOGI(TAG, "link up");
        eth_ts_log_eee();
        break;
    case ETHERNET_EVENT_DISCONNECTED:
        s_link_up = false;
        ESP_LOGW(TAG, "link down");
        break;
    default: break;
    }
}

// ---------------------------------------------------------------------------
// Init
// ---------------------------------------------------------------------------

// HOLD, don't FLUSH, a frame that finds no free RX descriptor.
//
// IDF enables flushing (emac_hal_init_dma_default). A flow start makes the
// transmitter burst at line rate; 64 descriptors fill in ~1.6 ms whatever the
// CPU does, and a PTP Sync in the FIFO at that moment -- a TIMESTAMPED frame
// -- hung the MTL RX read controller in "reading frame status / timestamp"
// with the FIFO full (EMACDEBUG 0x340): receive dead until a reboot. Seen at
// every flow start once 96 kHz ran 6000 DMA blocks/s. With flushing disabled
// the frame waits in the FIFO for a descriptor (the driver issues a receive
// poll demand as it returns them) and newer frames overflow at the FIFO
// instead -- a counted, recoverable drop.
#include "soc/emac_dma_struct.h"
static void rx_hold_not_flush(void)
{
    EMAC_DMA.dmaoperation_mode.dis_flush_recv_frames = 1;
}

esp_err_t eth_ts_init(void)
{
    eth_mac_config_t mac_cfg = ETH_MAC_DEFAULT_CONFIG();
    // EMAC RECEIVE TASK ABOVE EVERYTHING. IDF's default is 15, unpinned --
    // below the I2S (23), audio RX (22) and PTP (21) tasks on core 0. Starved
    // during a burst (two flows overlapping in a make-before-break repatch),
    // the RX DMA ran out of descriptors and suspended, and since IDF wakes
    // this task only on "frame received", receive never restarted: bench, RX
    // dead for good while TX (heartbeats) carried on. It only copies frames
    // out; running it first costs nothing.
    mac_cfg.rx_task_prio = 24;
    eth_phy_config_t phy_cfg = ETH_PHY_DEFAULT_CONFIG();
    phy_cfg.phy_addr    = AP_ETH_PHY_ADDR;
    phy_cfg.reset_gpio_num = AP_PIN_ETH_PHY_RST;

