Nickster90s/Inferno-ESP32-P4/main/eth_ts.c
    eth_esp32_emac_config_t esp32_cfg = ETH_ESP32_EMAC_DEFAULT_CONFIG();
    esp32_cfg.smi_gpio.mdc_num  = AP_PIN_ETH_MDC;
    esp32_cfg.smi_gpio.mdio_num = AP_PIN_ETH_MDIO;
    // EXTERNAL 50 MHz into GPIO50. If this were EMAC_CLK_OUT the RMII clock
    // would be generated from the internal APLL, the APLL would be unavailable
    // as the media clock, and mclk_hw.c would have nothing to trim. The
    // Waveshare ESP32-P4-ETH wires an external oscillator, which is why this
    // design is possible on this board.
    esp32_cfg.clock_config.rmii.clock_mode = EMAC_CLK_EXT_IN;
    // On the P4 this is set here, not in Kconfig: CONFIG_ETH_RMII_CLK_* is
    // ESP32-only in IDF 5.5 and silently absent on this target.
    esp32_cfg.clock_config.rmii.clock_gpio = (emac_rmii_clock_gpio_t)AP_PIN_ETH_REF_CLK;

    s_mac = esp_eth_mac_new_esp32(&esp32_cfg, &mac_cfg);
    if (!s_mac) return ESP_FAIL;
    s_phy = esp_eth_phy_new_ip101(&phy_cfg);
    if (!s_phy) return ESP_FAIL;

    esp_eth_config_t cfg = ETH_DEFAULT_CONFIG(s_mac, s_phy);
    ESP_ERROR_CHECK(esp_eth_driver_install(&cfg, &s_eth));

    ESP_ERROR_CHECK(esp_read_mac(s_our_mac, ESP_MAC_ETH));
    ESP_ERROR_CHECK(esp_eth_ioctl(s_eth, ETH_CMD_S_MAC_ADDR, s_our_mac));

    // --- IEEE 1588 ---------------------------------------------------------
    //
    // IDF 5.5 has no Kconfig switch for this; the capability is
    // SOC_EMAC_IEEE1588V2_SUPPORTED and the API is esp_eth_ioctl().
    //
    // Stamping ALL frames is the part that matters for AoIP. IDF's
    // emac_hal_ptp_start() enables only PTP-over-Ethernet (L2) and PTPv2
    // parsing, and never sets en_proc_ptp_ipv4_udp or en_ts4all -- so as
    // shipped, PTPv1 over UDP 319/320 is never stamped and every Sync would
    // land in ptp_no_hw_ts. IDF exposes no ioctl for it, so we set TSENALL in
    // the register directly, after the driver has finished its own setup.
#if SOC_EMAC_IEEE1588V2_SUPPORTED
    {
        bool on = true;
        esp_err_t err = esp_eth_ioctl(s_eth, ETH_MAC_ESP_CMD_PTP_ENABLE, &on);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "PTP timestamping unavailable (%s). Without hardware "
                          "timestamps this device cannot hold a media clock.",
                     esp_err_to_name(err));
            return err;
        }
        // Stamp ONLY PTPv1 event messages over UDP/IPv4 -- NOT every frame.
        //
        // This used to set en_ts4all, which stamps all frames, 1600+ audio
        // packets a second included. Under the bursts of a flow change the
        // MTL RX FIFO read controller hung in its "reading frame status /
        // timestamp" state (EMACDEBUG RRCSTS = 2, RXFSTS = 3: FIFO full), the
        // FIFO filled, and every later frame was dropped before the DMA --
        // receive dead for good, TX alive, and no EMAC or PHY restart
        // recovering it. The classifier below selects Sync (slave, event
        // messages, IEEE 1588-2002 format) and stamps a few frames a second.
        typeof(EMAC_PTP.timestamp_ctrl) tc = EMAC_PTP.timestamp_ctrl;
        tc.en_ts4all                    = 0;
        tc.en_ptp_pkg_proc_ver2_fmt     = 0;     // PTPv1 (1588-2002) messages
        tc.en_proc_ptp_ether_frm        = 0;     // not PTP-over-Ethernet
        tc.en_proc_ptp_ipv6_udp         = 0;
        tc.en_proc_ptp_ipv4_udp         = 1;     // PTP over UDP/IPv4, ports 319/320
        tc.en_ts_snap_event_msg         = 1;     // event messages only
        tc.en_snap_msg_relevant_master  = 0;     // slave: stamp Sync
        tc.sel_snap_type                = 0;
        EMAC_PTP.timestamp_ctrl = tc;
        ESP_LOGI(TAG, "IEEE 1588 timestamping enabled: PTPv1 Sync over UDP/IPv4 only");
    }
#else
#error "This target's EMAC has no IEEE 1588 unit -- a software timestamp is not good enough for a media clock."
#endif

    // 802.3x flow control: OFF.
    //
    // It was on, because the AES67 work on this chip measured multicast frame
    // loss without it. But with IDF's hardware flow control the MAC sends
    // PAUSE whenever its RX FIFO fills, and a receive stall during a burst
    // (flow changes: two flows overlapping, a flow stopped while packets are
    // still in flight) became a DEADLOCK: the MAC kept pausing the switch, the
    // switch forwarded nothing to this port, nothing drained the FIFO. On the
    // bench every patch change could kill receive for good -- transmit still
    // working, and no EMAC or PHY reset on our side recovering it. Without
    // flow control an overload drops frames instead, which the jitter buffer
    // and the flow liveness check handle.
    bool fc = false;
    esp_eth_ioctl(s_eth, ETH_CMD_S_FLOW_CTRL, &fc);
    rx_hold_not_flush();

    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    s_netif = esp_netif_new(&netif_cfg);
    ESP_ERROR_CHECK(esp_netif_attach(s_netif, esp_eth_new_netif_glue(s_eth)));

    // Take over the input path so PTP frames can be seen with their timestamps.
    ESP_ERROR_CHECK(esp_eth_update_input_path_info(s_eth, stack_input_info, s_netif));

    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                               eth_event_handler, NULL));
    return ESP_OK;
}

// ---------------------------------------------------------------------------
// ENERGY-EFFICIENT ETHERNET OFF.
//
// With EEE (802.3az) the link drops into low-power idle between frames and the
// next frame pays a ~30 us wake-up. On a link carrying only PTP that is every
// Sync; once audio flows at 1500 pps the link never sleeps and the penalty
// vanishes. Bench trace: t2 - t1 fell by 36 us the moment the flow came up,
// the boot-time path delay (39 us, measured idle) no longer matched, lock was
// lost -- and before the servo fix, the kick from it froze the servo into the
// "71 s step". A PTP slave wants a link whose delay does not depend on load.
//
// MMD 7 register 60 is our EEE advertisement; 61 is the partner's. Clause-22
// indirect access through registers 13 (control) and 14 (address/data).
// ---------------------------------------------------------------------------

static esp_err_t phy_rd(uint32_t reg, uint32_t *v)
{
    esp_eth_phy_reg_rw_data_t d = { .reg_addr = reg, .reg_value_p = v };
    return esp_eth_ioctl(s_eth, ETH_CMD_READ_PHY_REG, &d);
}
static esp_err_t phy_wr(uint32_t reg, uint32_t v)
{
    esp_eth_phy_reg_rw_data_t d = { .reg_addr = reg, .reg_value_p = &v };
    return esp_eth_ioctl(s_eth, ETH_CMD_WRITE_PHY_REG, &d);
}
static esp_err_t mmd_rd(uint16_t dev, uint16_t reg, uint32_t *v)
{
    phy_wr(13, dev); phy_wr(14, reg); phy_wr(13, 0x4000 | dev);
    return phy_rd(14, v);
}
static esp_err_t mmd_wr(uint16_t dev, uint16_t reg, uint16_t v)
{
    phy_wr(13, dev); phy_wr(14, reg); phy_wr(13, 0x4000 | dev);
    return phy_wr(14, v);
}

static void eee_disable(void)
{
    uint32_t adv = 0xFFFF, lp = 0xFFFF;
    mmd_rd(7, 60, &adv);
    mmd_rd(7, 61, &lp);
    mmd_wr(7, 60, 0);
    uint32_t now = 0xFFFF;
    mmd_rd(7, 60, &now);
    ESP_LOGI(TAG, "EEE advert 0x%04x -> 0x%04x (partner last 0x%04x)",
             (unsigned)adv, (unsigned)now, (unsigned)lp);
}

// ---------------------------------------------------------------------------
// RECEIVE WATCHDOG. PTP alone brings ~8 frames/s, so a second with none while
// the link is up means receive has stalled. First try a KICK: wake IDF's
// emac_rx task so it drains whatever descriptors it is sitting on, and poke
// the DMA's receive-poll register so a suspended DMA looks again. If that
// does not bring frames back, restart the EMAC (which also drops and
// re-acquires the IP -- ~10 s -- but beats a dead device).
// ---------------------------------------------------------------------------
#include "soc/emac_dma_struct.h"
#include "soc/emac_mac_struct.h"

#include "esp_attr.h"
#include "esp_system.h"
// Survives the reboot it counts (not zeroed at a software reset).
static RTC_NOINIT_ATTR uint32_t s_fifo_hang_reboots;
static RTC_NOINIT_ATTR uint32_t s_fifo_hang_magic;
uint32_t eth_ts_fifo_hang_reboots(void) { return s_fifo_hang_reboots; }

static void rx_watchdog_task(void *arg)
{
    (void)arg;
    if (s_fifo_hang_magic != 0x46494630u) { s_fifo_hang_magic = 0x46494630u; s_fifo_hang_reboots = 0; }
    uint32_t last = s_rx_frames;
    int idle_ms = 0;
    TaskHandle_t emac_rx = NULL;
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(250));
        uint32_t now = s_rx_frames;
        if (now != last || !s_link_up) { last = now; idle_ms = 0; continue; }
        idle_ms += 250;
        if (idle_ms == 1000) {
            // What does the MAC see? RX DMA state + frames it had to drop.
            uint32_t st = EMAC_DMA.dmastatus.recv_proc_state;
            uint32_t mf = EMAC_DMA.dmamissedfr.missed_fc;       // read clears
            uint32_t of = EMAC_DMA.dmamissedfr.overflow_fc;
            s_rx_dma_state = st; s_rx_missed += mf; s_rx_fifo_ovf += of;
            ESP_LOGW(TAG, "RX idle 1 s: dma state %u (3 wait, 4 SUSPENDED no-desc), "
                          "missed %u, fifo overflow %u", (unsigned)st, (unsigned)mf, (unsigned)of);
        }
        if (idle_ms == 1000 || idle_ms == 2000) {
            if (!emac_rx) emac_rx = xTaskGetHandle("emac_rx");
            if (emac_rx) xTaskNotifyGive(emac_rx);
            EMAC_DMA.dmarxpolldemand = 1;
            s_rx_kicks++;
            ESP_LOGW(TAG, "no RX for %d ms -- kicked emac_rx (#%u)", idle_ms,
                     (unsigned)s_rx_kicks);
        } else if (idle_ms == 3000 && EMAC_MAC.emacdebug.mtlrfrcs == 2 &&
                   EMAC_MAC.emacdebug.mtlrffls == 3) {
            // THE RX FIFO HANG: read controller stuck on a frame's status /
            // timestamp, FIFO full (EMACDEBUG 0x340). Neither esp_eth_stop/
            // start nor a PHY reset clears it -- measured, 19 restarts in a
            // row -- only a MAC software reset does, and that is a reboot's
            // worth of state (PTP clock, filters, flows). So reboot: audio
            // is back in ~25 s instead of never.
            s_fifo_hang_reboots++;
            ESP_LOGE(TAG, "RX FIFO hang (EMACDEBUG %08x) -- rebooting (#%u)",
                     (unsigned)EMAC_MAC.emacdebug.val, (unsigned)s_fifo_hang_reboots);
            vTaskDelay(pdMS_TO_TICKS(100));
            esp_restart();
        } else if (idle_ms == 4000) {
            s_rx_restarts++;
            ESP_LOGE(TAG, "RX still dead -- restarting EMAC (#%u)", (unsigned)s_rx_restarts);
            esp_eth_stop(s_eth);
            esp_eth_start(s_eth);
            rx_hold_not_flush();
        } else if (idle_ms >= 8000) {
            // Even an EMAC restart did not help: the silence is below the MAC.
            // Soft-reset the PHY (BMCR bit 15), put EEE back off, renegotiate.
            s_phy_resets++;
            ESP_LOGE(TAG, "RX dead after EMAC restart -- PHY soft reset (#%u)",
                     (unsigned)s_phy_resets);
            phy_wr(0, 0x8000);
            vTaskDelay(pdMS_TO_TICKS(50));
            mmd_wr(7, 60, 0);
            phy_wr(0, 0x1200);                 // AN enable + restart
            idle_ms = 0;
        }
    }
}

uint32_t eth_ts_rx_kicks(void)    { return s_rx_kicks; }
uint32_t eth_ts_rx_restarts(void) { return s_rx_restarts; }
uint32_t eth_ts_phy_resets(void)  { return s_phy_resets; }
// Raw MAC receive-side registers, healthy vs dead.
void eth_ts_mac_dump(void)
{
    printf("  mac       config %08x  frame-filter %08x  debug %08x\n",
           (unsigned)EMAC_MAC.gmacconfig.val, (unsigned)EMAC_MAC.gmacff.val,
           (unsigned)EMAC_MAC.emacdebug.val);
    printf("  mac addr0 %08x %08x\n", (unsigned)EMAC_MAC.emacaddr0high.val,
           (unsigned)EMAC_MAC.emacaddr0low);
    for (int i = 0; i < 15; i++) {
        if (EMAC_MAC.emacaddr[i].emacaddrhigh.address_enable)
            printf("  mac addr%-2d %08x %08x\n", i + 1,
                   (unsigned)EMAC_MAC.emacaddr[i].emacaddrhigh.val,
                   (unsigned)EMAC_MAC.emacaddr[i].emacaddrlow);
    }
}

void eth_ts_rx_diag(uint32_t *dma_state_now, uint32_t *missed, uint32_t *fifo_ovf)
{
    *dma_state_now = EMAC_DMA.dmastatus.recv_proc_state;
    uint32_t mf = EMAC_DMA.dmamissedfr.missed_fc, of = EMAC_DMA.dmamissedfr.overflow_fc;
    s_rx_missed += mf; s_rx_fifo_ovf += of;
    *missed = s_rx_missed; *fifo_ovf = s_rx_fifo_ovf;
}

