Nickster90s/Inferno-ESP32-P4/main/eth_ts.c
esp_err_t eth_ts_start(void)
{
    eee_disable();                   // before autonegotiation starts
    esp_err_t err = esp_eth_start(s_eth);
    rx_hold_not_flush();
    xTaskCreatePinnedToCore(rx_watchdog_task, "rx_wdog", 3072, NULL, 10, NULL, 1);
    return err;
}

// Log the partner's EEE ability once the link is up (diagnostic).
void eth_ts_log_eee(void)
{
    uint32_t adv = 0xFFFF, lp = 0xFFFF;
    mmd_rd(7, 60, &adv);
    mmd_rd(7, 61, &lp);
    ESP_LOGI(TAG, "EEE after link: ours 0x%04x, partner 0x%04x -> %s", (unsigned)adv,
             (unsigned)lp, (adv & lp & 0x0006) ? "EEE ACTIVE" : "EEE off");
}
bool eth_ts_link_up(void)    { return s_link_up; }
const uint8_t *eth_ts_mac(void) { return s_our_mac; }
esp_netif_t *eth_ts_netif(void) { return s_netif; }
void eth_ts_register_ptp_cb(eth_ts_ptp_cb_t cb) { s_ptp_cb = cb; }

// ---------------------------------------------------------------------------
// PTP clock
// ---------------------------------------------------------------------------

esp_err_t eth_ts_get_time(eth_ts_time_t *t)
{
    eth_mac_time_t mt;
    esp_err_t err = esp_eth_ioctl(s_eth, ETH_MAC_ESP_CMD_G_PTP_TIME, &mt);
    if (err != ESP_OK) return err;
    t->seconds     = mt.seconds;
    t->nanoseconds = mt.nanoseconds;
    return ESP_OK;
}

esp_err_t eth_ts_set_time(const eth_ts_time_t *t)
{
    eth_mac_time_t mt = { .seconds = t->seconds, .nanoseconds = t->nanoseconds };
    return esp_eth_ioctl(s_eth, ETH_MAC_ESP_CMD_S_PTP_TIME, &mt);
}

esp_err_t eth_ts_step_time(int64_t delta_ns)
{
    eth_ts_time_t t;
    esp_err_t err = eth_ts_get_time(&t);
    if (err != ESP_OK) return err;

    int64_t now = (int64_t)t.seconds * 1000000000LL + t.nanoseconds + delta_ns;
    if (now < 0) now = 0;
    t.seconds     = (uint32_t)(now / 1000000000LL);
    t.nanoseconds = (uint32_t)(now % 1000000000LL);
    return eth_ts_set_time(&t);
}

// Fine rate control: the MAC's addend register. This is the same actuator the
// FPGA's gPTP servo drove (gptp.c, the 52-bit TSU addend) -- note that it
// disciplines the PTP TIME BASE, not the audio clock. Two separate actuators,
// two separate loops, and they must not be crossed: pointing the media clock
// at the PTP phase term broke audio twice on the FPGA.
esp_err_t eth_ts_set_rate_ppb(int32_t ppb)
{
    s_rate_ppb = ppb;
    // ETH_MAC_ESP_CMD_ADJ_PTP_TIME, not ..._ADJ_PTP_FREQ: in IDF 5.5 the former
    // (emac_hal_ptp_adj_inc) sets the addend to base * 1e9 / (1e9 - ppb) --
    // ABSOLUTE ppb against the addend captured at first call, which is what
    // the servo emits. ADJ_PTP_FREQ multiplies the CURRENT addend by a double,
    // so calling it every update would compound. Positive ppb = faster, which
    // matches ptp_servo's sign (offset = slave - master, output = -gain * offset).
    return esp_eth_ioctl(s_eth, ETH_MAC_ESP_CMD_ADJ_PTP_TIME, &ppb);
}

int32_t eth_ts_get_rate_ppb(void) { return s_rate_ppb; }

// ---------------------------------------------------------------------------
// Raw UDP multicast transmit with TX timestamp
// ---------------------------------------------------------------------------

static uint16_t ip_checksum(const uint8_t *p, uint32_t len)
{
    uint32_t sum = 0;
    for (uint32_t i = 0; i + 1 < len; i += 2) sum += dw_rd16(p + i);
    if (len & 1) sum += (uint32_t)p[len - 1] << 8;
    while (sum >> 16) sum = (sum & 0xFFFF) + (sum >> 16);
    return (uint16_t)~sum;
}

esp_err_t eth_ts_send_udp_mcast(uint32_t dst_ip, uint16_t dst_port, uint16_t src_port,
                                const uint8_t *payload, uint32_t len, uint8_t tos,
                                uint8_t ttl, eth_ts_time_t *tx_ts)
{
    uint8_t frame[14 + 20 + 8 + 256];
    if (len > sizeof(frame) - 42) return ESP_ERR_INVALID_SIZE;

    esp_netif_ip_info_t ip;
    if (esp_netif_get_ip_info(s_netif, &ip) != ESP_OK) return ESP_FAIL;
    uint32_t src_ip = ntohl(ip.ip.addr);

    // Destination MAC for an IPv4 multicast group: 01:00:5e + low 23 bits.
    frame[0] = 0x01; frame[1] = 0x00; frame[2] = 0x5e;
    frame[3] = (uint8_t)((dst_ip >> 16) & 0x7F);
    frame[4] = (uint8_t)((dst_ip >> 8) & 0xFF);
    frame[5] = (uint8_t)(dst_ip & 0xFF);
    memcpy(frame + 6, s_our_mac, 6);
    dw_wr16(frame + 12, 0x0800);

    uint8_t *ipp = frame + 14;
    uint32_t total = 20 + 8 + len;
    memset(ipp, 0, 20);
    ipp[0] = 0x45;
    ipp[1] = tos;
    dw_wr16(ipp + 2, (uint16_t)total);
    ipp[8] = ttl;
    ipp[9] = 17;                       // UDP
    dw_wr32(ipp + 12, src_ip);
    dw_wr32(ipp + 16, dst_ip);
    dw_wr16(ipp + 10, ip_checksum(ipp, 20));

    uint8_t *udp = ipp + 20;
    dw_wr16(udp + 0, src_port);
    dw_wr16(udp + 2, dst_port);
    dw_wr16(udp + 4, (uint16_t)(8 + len));
    dw_wr16(udp + 6, 0);               // checksum optional over IPv4
    memcpy(udp + 8, payload, len);

    uint32_t frame_len = 14 + total;

    // IDF 5.5: `ctrl` is an eth_mac_time_t* the driver fills after polling the
    // descriptor; on timeout it writes 0/0 and still returns ESP_OK, so a
    // zero stamp must be treated as a failed send for PTP purposes.
    eth_mac_time_t ts = {0};
    esp_err_t err = esp_eth_transmit_ctrl_vargs(s_eth, &ts, 2, frame, frame_len);
    if (err == ESP_OK && ts.seconds == 0 && ts.nanoseconds == 0) err = ESP_ERR_TIMEOUT;
    if (err == ESP_OK && tx_ts) {
        tx_ts->seconds     = ts.seconds;
        tx_ts->nanoseconds = ts.nanoseconds;
    }
    return err;
}

// ---------------------------------------------------------------------------

esp_err_t eth_ts_mcast_allow(uint32_t group_ip)
{
    uint8_t mac[6] = { 0x01, 0x00, 0x5e,
                       (uint8_t)((group_ip >> 16) & 0x7F),
                       (uint8_t)((group_ip >> 8) & 0xFF),
                       (uint8_t)(group_ip & 0xFF) };
    // *** PORTING POINT *** -- ESP-IDF's per-group MAC filter ioctl. If the
    // build has none, the EMAC will pass all multicast and the software filter
    // carries the whole flood. That is survivable at 8 channels but it is
    // exactly the condition RX_GATE.md measured as 21% control-plane loss.
    ESP_LOGI(TAG, "mcast filter += %02x:%02x:%02x:%02x:%02x:%02x",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return esp_eth_ioctl(s_eth, ETH_CMD_ADD_MAC_FILTER, mac);
}
